{
    "Search Item": "1. Click on the search bar. 2. Enter the 'Item Name' to search for. 3. Press the 'Enter' key or click the search button.",
    "Send Text Message": "1. Click on the input box field. 2. type the specific message to be sent. 3. Press the 'Enter' key or 'Send' button",
    "Open Section": "1. Navigate to the relevant page: Inside the app, use clearly marked icons or tabs to navigate to the page where the task needs to be performed. For example, viewing 'My Info' may require tapping the 'Me' tab at the bottom. 2. Select the specified function: On the target page, find and execute the specific function. For example, to search for a feature, you may need to tap the 'Search' icon and enter keywords.",
    "View Content": "1. Locate the specified content: Find the specific news, post, or video. 2. View the content details: If further viewing is required, tap to open the detail page. 3. Perform the viewing action: On the detail page, view or browse the specified content. 4. Finish viewing: After completing the required viewing steps, the task process can be concluded.",
    "Interact": "1.Identify the target content: In the content list, scroll to find the specific content or locate the content based on the provided step instructions. 2. Perform the interaction: Based on parameter1 (content type such as video or article) and parameter2 (interaction type such as like or comment), tap the corresponding interaction icon (such as the like button or comment button) to complete the action.",
    "Manage Collections": "1. Perform the management operation. Based on the required action, perform the management task (parameter1: 'Add to Favorites', 'Delete', etc.). 2. Select the specific item: Find the object you need to manage (parameter2: 'Product', 'Video', etc.) and perform the corresponding action.3. Finally, ensure the management operation is confirmed, such as tapping the Confirm or Submit button.",
    "Share Content": "1. Locate the content to be shared (such as a news article, video, etc.). 2. Tap the share icon to initiate the sharing action (usually located at the bottom of the page or in the top-right corner as a share button). 3. Select the sharing platform (e.g., WeChat) from the sharing options. 4. Choose the recipient on the selection page (for example, in WeChat, find and tap on the target contact’s name, such as Lucky). 5. Confirm and complete the sharing (tap the Send or Confirm button to finalize the sharing).",
    "Check Notifications":  "1. Find the relevant notification or message section, such as ‘System Notifications’ or ‘Private Messages’. 2. Tap to enter the notification or message viewing screen. 3. View and browse the details of the notifications or messages.",
    "Modify Settings": "1. Enter the app settings, and locate relevant options such as 'Theme Skin' or 'Notification Methods'. 2. Adjust and save the app's settings as per your requirements.",
    "Create or Edit Entry": "1. Create or edit an entry: Create a new entry: Tap the button typically marked 'Add' or '+' on the page. Edit an existing entry: Find the item you want to edit, press and hold or tap on it, then choose the 'Edit' option. 2. Enter information: In the edit box or form that appears, input or modify the necessary information, such as name, type, etc. 3. Save the changes: After completing the edits, tap 'Save' or 'Finish' to confirm all changes."
}